status/src/2024/0517.org
#+TITLE: 11 May 2024 - 17 May 2024

* MIT OCW
** 18.06sc (Linear Algebra)
*** Unit II: Orthogonal Matrices and Gram-Schmidt
* SJ grounds
Mowing
* Prado fence
Helped patch corner that fell apart.
* SCZ Front Step
** Identified piece of chactacote that should work for door sill
* Jointer
Rewiring Done.
* gaiasky
** broken from arch updates (or something...)
** HDF stuff continuing
Memory problems addressed.
* Andromeda Path analysis
** Initial path complete.
** Continuing "fun" reconciling EDD catalog with GAIA DR3
*** Distance modulus data more or less matches
