status/2024/0517.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-25 Sat 06:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>11 May 2024 - 17 May 2024</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">11 May 2024 - 17 May 2024</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org083ded4">1. MIT OCW</a>
<ul>
<li><a href="#org7fa7677">1.1. 18.06sc (Linear Algebra)</a>
<ul>
<li><a href="#orgc7b3670">1.1.1. Unit II: Orthogonal Matrices and Gram-Schmidt</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc6b5e60">2. SJ grounds</a></li>
<li><a href="#org5b0dd8e">3. Prado fence</a></li>
<li><a href="#org9d2e3d6">4. SCZ Front Step</a>
<ul>
<li><a href="#orgb0792ed">4.1. Identified piece of chactacote that should work for door sill</a></li>
</ul>
</li>
<li><a href="#org8d618ac">5. Jointer</a></li>
<li><a href="#org0d2e718">6. gaiasky</a>
<ul>
<li><a href="#orgb356534">6.1. broken from arch updates (or something&#x2026;)</a></li>
<li><a href="#org9f442e5">6.2. HDF stuff continuing</a></li>
</ul>
</li>
<li><a href="#orgca754ff">7. Andromeda Path analysis</a>
<ul>
<li><a href="#orgd090a59">7.1. Initial path complete.</a></li>
<li><a href="#orgc9ff9ee">7.2. Continuing "fun" reconciling EDD catalog with GAIA DR3</a>
<ul>
<li><a href="#orgc18c375">7.2.1. Distance modulus data more or less matches</a></li>
<li><a href="#org7966f88">7.2.2. Studying refinement of DR3 parallax conversion</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga3dbb0d">8. into the west</a></li>
<li><a href="#org61172ce">9. steel-pan lilypond</a></li>
<li><a href="#org49fc2eb">10. tbattery</a></li>
<li><a href="#org501484f">11. ca-r</a></li>
<li><a href="#org593da51">12. xz compromise</a></li>
<li><a href="#org6d0c6d0">13. CA Root Key Generation</a>
<ul>
<li><a href="#org4668b48">13.1. First pass done</a>
<ul>
<li><a href="#org4349344">13.1.1. Based on https://pki-tutorial.readthedocs.io/en/latest/simple/</a></li>
<li><a href="#org4a1577c">13.1.2. Work continues</a></li>
</ul>
</li>
<li><a href="#orgc7e1004">13.2. Need to be clear on security properties.</a></li>
<li><a href="#orge6e22cf">13.3. Simple hardware.</a>
<ul>
<li><a href="#org8cca178">13.3.1. Use beagleboard with local interface</a></li>
<li><a href="#orga71378a">13.3.2. Use some modern device TPM</a></li>
<li><a href="#orgd0d49ee">13.3.3. Or something that uses PKCS11 interface</a></li>
</ul>
</li>
<li><a href="#orge987efd">13.4. USB Serial interface only but no credentials across USB I/F.</a></li>
<li><a href="#org845ee34">13.5. Use Sneakernet</a></li>
</ul>
</li>
<li><a href="#orgfad7eea">14. Compilers</a>
<ul>
<li><a href="#org24cc600">14.1. Compiled Wikipedia PL/0 example</a></li>
<li><a href="#orgb44a01b">14.2. Work out overall plan.</a></li>
<li><a href="#orgb83c859">14.3. Looking into LLVM MLIR.</a></li>
<li><a href="#orgf3049e8">14.4. ASDL</a>
<ul>
<li><a href="#org2e7b56c">14.4.1. current smlnj C++ implementation incomplete</a></li>
<li><a href="#orgb2ac089">14.4.2. old versions asdl source fail to build with new versions of smlnj</a></li>
<li><a href="#orged19f3a">14.4.3. old versions of smlnj not easily buildable on x86<sub>64</sub></a></li>
<li><a href="#org106872a">14.4.4. ancient binary of asdl 1.2 compiler seems to work</a></li>
<li><a href="#orgf742429">14.4.5. analyzing asdl 1.2 generated code</a></li>
<li><a href="#org23d4996">14.4.6. run in vm?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgae3e16b">15. Piper dovecot</a>
<ul>
<li><a href="#org717527d">15.1. Update broke dovecot auth.</a></li>
<li><a href="#orgf0c7539">15.2. Set tuffy up as a staging server</a></li>
<li><a href="#org2604723">15.3. piper dovecot SSL certificate <b>NOT</b> broken</a></li>
</ul>
</li>
<li><a href="#orgb054e7b">16. Various i686</a>
<ul>
<li>
<ul>
<li><a href="#orge9e3b5d">16.0.1. netbsd</a></li>
<li><a href="#orgc33ff76">16.0.2. buildroot</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8dfdbb6">17. piper</a>
<ul>
<li><a href="#orge5a3a45">17.1. dovecot</a>
<ul>
<li><a href="#org64b6dc6">17.1.1. Raising apparmor error.</a></li>
</ul>
</li>
<li><a href="#orga798e8f">17.2. pidgeonhole</a>
<ul>
<li><a href="#org7727fe7">17.2.1. procmail replacement.</a></li>
<li><a href="#org1921af7">17.2.2. Considering integration.</a></li>
</ul>
</li>
<li><a href="#orgf877e27">17.3. httpd</a>
<ul>
<li><a href="#orgec154fb">17.3.1. Still stable.</a></li>
</ul>
</li>
<li><a href="#org4115220">17.4. SSL cert</a></li>
<li><a href="#org9fe3b10">17.5. redmine</a></li>
<li><a href="#orgee39d13">17.6. openvpn</a></li>
</ul>
</li>
<li><a href="#orgf30fc07">18. Buffalo WZR-HP-G300NH</a>
<ul>
<li><a href="#org18d0953">18.1. Update</a></li>
</ul>
</li>
<li><a href="#org3fbebaf">19. SJC weather station</a>
<ul>
<li><a href="#orgb3af366">19.1. Proper enclosure mostly constructed</a>
<ul>
<li><a href="#orgc56fca0">19.1.1. Needs a redo on bottom plate</a></li>
<li><a href="#orgba51fb3">19.1.2. Seems to have improved wireless connectivity somewhat</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge67b96f">20. opencl</a>
<ul>
<li><a href="#orga2cb3a9">20.1. Studying. Have some examples working.</a></li>
<li><a href="#orgf3417ff">20.2. Need to look at arrayfire as an alternative.</a></li>
<li><a href="#orgc74734b">20.3. This is a bit of a hammer looking for a nail.</a></li>
</ul>
</li>
<li><a href="#org2bec67d">21. EPLDH</a>
<ul>
<li><a href="#org9964038">21.1. MPFI interval arithmetic better alternative</a></li>
</ul>
</li>
<li><a href="#org024aef3">22. wktpqb</a>
<ul>
<li><a href="#org945b916">22.1. needs a new approach</a></li>
<li><a href="#orgcd4f205">22.2. Verifying edge construction (con't.)</a></li>
<li><a href="#orgfa607f2">22.3. 'gcd' algorithm doesn't work</a></li>
</ul>
</li>
<li><a href="#org93070ed">23. Mill Controller #2</a>
<ul>
<li><a href="#org576dc52">23.1. Mounted on mill - ready or testing</a></li>
<li><a href="#org4113518">23.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#org32e45e8">23.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#orgad0395c">23.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
<li><a href="#org5d64c44">23.3. Alternative architecture</a>
<ul>
<li><a href="#org5976a09">23.3.1. Split off stepper motor controller to separate board</a></li>
<li><a href="#org3bef7f6">23.3.2. Use emc2 MODBUS/TCP protocol for stepper and other IO</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org25eddcf">24. Alum Rock Data Center</a>
<ul>
<li><a href="#orged30686">24.1. May have problem with network power module.</a></li>
<li><a href="#org5d31d65">24.2. Added Ethernet card to tuffy</a></li>
<li><a href="#orgb387196">24.3. Need a VPS with static IP</a></li>
</ul>
</li>
<li><a href="#org5941bc4">25. Virtual Orchestra</a>
<ul>
<li><a href="#orgf7e32aa">25.1. sfz file tests</a>
<ul>
<li><a href="#org2adefa5">25.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#org02ac308">25.2. increasingly skeptical whether quality results are possible</a></li>
<li><a href="#org1c7d4ef">25.3. maybe should treat as platform for concatinative synthesis</a></li>
<li><a href="#orgf44a342">25.4. maybe should just accept the limitations and work with it</a></li>
</ul>
</li>
<li><a href="#org9322288">26. gat</a>
<ul>
<li><a href="#org652ea7d">26.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#org87cbb11">27. RIOT drivers</a>
<ul>
<li><a href="#orgaa4234d">27.1. WS2801</a></li>
<li><a href="#orgf50fa64">27.2. Velleman KA03</a></li>
<li><a href="#org9fb055d">27.3. Velleman KA05</a></li>
</ul>
</li>
<li><a href="#org530cea8">28. mcd05 32 button/led box</a>
<ul>
<li><a href="#orgb3b610b">28.1. Recovered schematics.</a></li>
<li><a href="#orga2f42d1">28.2. Planning software.</a></li>
<li><a href="#orgfe5e255">28.3. Received STM32F767 Nucleo144 with Ethernet.</a>
<ul>
<li><a href="#org0d81c46">28.3.1. Test program running.</a></li>
<li><a href="#orge233df0">28.3.2. Need to consider CoAP multicast discovery.</a></li>
<li><a href="#orgf9a05c6">28.3.3. Consider simpler architecture with STM32F767 as a 'hub'.</a></li>
<li><a href="#org689a044">28.3.4. Consider CAN interface to hub.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge7f0178">29. AMD 2900 bitslice computing</a>
<ul>
<li><a href="#org6290df1">29.1. Probably my oldest uncompleted project</a></li>
<li><a href="#org92d286c">29.2. Exploring possibilities for something constructive</a></li>
</ul>
</li>
<li><a href="#org13c22ce">30. Hitachi HD68B09E CPU</a>
<ul>
<li><a href="#orgf40ed03">30.1. RAM/UART/IO</a></li>
<li><a href="#orgadd0896">30.2. Started schematic</a>
<ul>
<li><a href="#orge07400b">30.2.1. Standard peripheral set for 8 bit CPU bringups</a></li>
</ul>
</li>
<li><a href="#org6f373ec">30.3. Arduino Mega 2560 DMA loader</a></li>
<li><a href="#org328441b">30.4. Generate quadrature clock directly</a></li>
<li><a href="#orga0f6154">30.5. Full Bus SW Emulation infeasible</a></li>
</ul>
</li>
<li><a href="#org2f4ca48">31. Rockwell R65F11</a>
<ul>
<li><a href="#orgb6d1cd5">31.1. Still evaluating.</a></li>
<li><a href="#org90ded1f">31.2. Dev board</a></li>
</ul>
</li>
<li><a href="#orga1bff4f">32. PLD programming</a></li>
<li><a href="#org235a1d8">33. EPROM Programming</a></li>
<li><a href="#orgf7df842">34. POSIT</a>
<ul>
<li><a href="#orgd71b8e2">34.1. Use POSITs for YRX?</a></li>
</ul>
</li>
<li><a href="#org2acef40">35. MAME</a>
<ul>
<li><a href="#org8355266">35.1. Subset builds in debug mode</a></li>
<li><a href="#org49abe11">35.2. gs6809 serial IO doesn't work right with PTY and other streams</a></li>
<li><a href="#org5bbcdc9">35.3. ampro (Z80/Z80SIO) <b>does</b> work with PTY</a></li>
<li><a href="#org78f9687">35.4. Evaluating what is needed for other emulators.</a></li>
</ul>
</li>
<li><a href="#org1fdf409">36. More project ideas</a>
<ul>
<li><a href="#org6f4d133">36.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org1ebf782">36.2. GMPForth ports to simulators</a>
<ul>
<li><a href="#orgc6b0e5e">36.2.1. SIMH for some targets (vax)</a></li>
<li><a href="#orga7b318e">36.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#orgbb22651">36.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org1bbfc52">36.3. GMPASM assembler</a></li>
<li><a href="#orgf165860">36.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org3a42a80">36.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#orgbe3c225">36.5.1. Offline compilation</a></li>
<li><a href="#orge88f10f">36.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#orgede07b9">36.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#orga991edd">36.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#orge0be7b7">36.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#orgb06204c">36.6.3. CPUs with totally async bus may be supportable without RAM</a></li>
<li><a href="#org5fb72f4">36.6.4. Could use small footprint monitor in asm (gmpmon?)</a></li>
</ul>
</li>
<li><a href="#orge08f3db">36.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#org8461911">36.7.1. OSI Superboard</a></li>
<li><a href="#org2cb587d">36.7.2. Super Jolt</a></li>
<li><a href="#org43a0106">36.7.3. Ampro Little Board</a></li>
<li><a href="#org72c275c">36.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#orgcb014b5">36.7.5. NMIX-0016</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcdffc4b">37. David Davies</a>
<ul>
<li><a href="#orgf0bc600">37.1. Broadcom (BCG?) Employee indicted for running a brothel.</a></li>
<li><a href="#orga29c4bc">37.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org057005c">37.3. Court website no longer allows seaching (grrr!)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org083ded4" class="outline-2">
<h2 id="org083ded4"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7fa7677" class="outline-3">
<h3 id="org7fa7677"><span class="section-number-3">1.1.</span> 18.06sc (Linear Algebra)</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgc7b3670" class="outline-4">
<h4 id="orgc7b3670"><span class="section-number-4">1.1.1.</span> Unit II: Orthogonal Matrices and Gram-Schmidt</h4>
</div>
</div>
</div>
<div id="outline-container-orgc6b5e60" class="outline-2">
<h2 id="orgc6b5e60"><span class="section-number-2">2.</span> SJ grounds</h2>
<div class="outline-text-2" id="text-2">
<p>
Mowing
</p>
</div>
</div>
<div id="outline-container-org5b0dd8e" class="outline-2">
<h2 id="org5b0dd8e"><span class="section-number-2">3.</span> Prado fence</h2>
<div class="outline-text-2" id="text-3">
<p>
Helped patch corner that fell apart.
</p>
</div>
</div>
<div id="outline-container-org9d2e3d6" class="outline-2">
<h2 id="org9d2e3d6"><span class="section-number-2">4.</span> SCZ Front Step</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgb0792ed" class="outline-3">
<h3 id="orgb0792ed"><span class="section-number-3">4.1.</span> Identified piece of chactacote that should work for door sill</h3>
</div>
</div>
<div id="outline-container-org8d618ac" class="outline-2">
<h2 id="org8d618ac"><span class="section-number-2">5.</span> Jointer</h2>
<div class="outline-text-2" id="text-5">
<p>
Rewiring Done.
</p>
</div>
</div>
<div id="outline-container-org0d2e718" class="outline-2">
<h2 id="org0d2e718"><span class="section-number-2">6.</span> gaiasky</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgb356534" class="outline-3">
<h3 id="orgb356534"><span class="section-number-3">6.1.</span> broken from arch updates (or something&#x2026;)</h3>
</div>
<div id="outline-container-org9f442e5" class="outline-3">
<h3 id="org9f442e5"><span class="section-number-3">6.2.</span> HDF stuff continuing</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Memory problems addressed.
</p>
</div>
</div>
</div>
<div id="outline-container-orgca754ff" class="outline-2">
<h2 id="orgca754ff"><span class="section-number-2">7.</span> Andromeda Path analysis</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd090a59" class="outline-3">
<h3 id="orgd090a59"><span class="section-number-3">7.1.</span> Initial path complete.</h3>
</div>
<div id="outline-container-orgc9ff9ee" class="outline-3">
<h3 id="orgc9ff9ee"><span class="section-number-3">7.2.</span> Continuing "fun" reconciling EDD catalog with GAIA DR3</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-orgc18c375" class="outline-4">
<h4 id="orgc18c375"><span class="section-number-4">7.2.1.</span> Distance modulus data more or less matches</h4>
</div>
