status/src/2024/0517.org
*** Studying refinement of DR3 parallax conversion
A *lot* more complicated!
* into the west
Done
* steel-pan lilypond
Recent lilypond broke steel-pan notation. Fixed shake-and-stomp as
a prototype solution. May need to find an approach that is less brittle.
* tbattery
(Old news). Wrote battery status monitor for FVWM integration based on
tclock in February.
* ca-r
Data no longer being updated, so weekly builds are stopped.
* xz compromise
Kaveri updated.
* CA Root Key Generation
Nice to have an appliance that manages keys.  Need to make this
simple. Really don't have time for a science project.  Too, bad,
though. It kind of *is* a science project.  Could just buy something
from nitrokey https://www.nitrokey.com/ but I really don't want to
spend money on it of I have hardware already.  Looking at nitrokey in
more detail, it doesn't seem to be any simpler than what I'm doing
already.
** First pass done
*** Based on https://pki-tutorial.readthedocs.io/en/latest/simple/
Interesting that the certs generated fail with openssl s_server testing because
the cryptographic algorithms are too weak.
*** Work continues
**** Have an outline with ECDSA/NIST-384
**** Have consolidated configuration across CAs.
**** Trying to decide if/how to deal with revocation. What a PITA.
** Need to be clear on security properties.
Definitely protect against remote access to private keys. How strong
does the protection against *local* access need to be?
** Simple hardware.
*** Use beagleboard with local interface
*** Use some modern device TPM
Need to export data for backup.
*** Or something that uses PKCS11 interface
** USB Serial interface only but no credentials across USB I/F.
But this potentially exposes the hardware to remote access via the USB
I/F when connected.
** Use Sneakernet
Doesn't scale. Should use something so cert updates are automatable.
But that's a science project it seems.
* Compilers
** Compiled Wikipedia PL/0 example
** Work out overall plan.
Lots of moving pieces.
** Looking into LLVM MLIR.
Will not use immediately, but perhaps trend in that direction.
** ASDL
*** current smlnj C++ implementation incomplete
*** old versions asdl source fail to build with new versions of smlnj
*** old versions of smlnj not easily buildable on x86_64
*** ancient binary of asdl 1.2 compiler seems to work
but associated libraries are to old to link because of missing ctype symbol
*** analyzing asdl 1.2 generated code
Most of the code is for serialization, which is going to be replaced
anyway, so can be removed by hand.
*** run in vm?
Analysis of binaries shows that it was built on some redhat os using
gcc 2.8.1. Redhat-6.2? No. Tried various ancient Redhat OSs.
* Piper dovecot
** Update broke dovecot auth.
Looks PAM related, but PAM update failed to fix.
** Set tuffy up as a staging server
So I don't debug on 'production'.
** piper dovecot SSL certificate *NOT* broken
At least not obviously broken (yet). Further investigation needed.
* Various i686
*** netbsd
was installed. But needed the box for something else.
*** buildroot
builds complete.
* piper
** dovecot
*** Raising apparmor error.
Not sure how to resolve.
** pidgeonhole
*** procmail replacement.
*** Considering integration.
** httpd
*** Still stable.
But seems to occassionally mis-serve files.
** SSL cert
Trying letsencrypt with certbot. http problem above may be interfering.
** redmine
Still not sure I want to go down this rabbit hole.
** openvpn
Need to consider cert construction.
* Buffalo WZR-HP-G300NH
** Update
Sometime next year.
