status/2024/0517.html
<div id="outline-container-org7966f88" class="outline-4">
<h4 id="org7966f88"><span class="section-number-4">7.2.2.</span> Studying refinement of DR3 parallax conversion</h4>
<div class="outline-text-4" id="text-7-2-2">
<p>
A <b>lot</b> more complicated!
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orga3dbb0d" class="outline-2">
<h2 id="orga3dbb0d"><span class="section-number-2">8.</span> into the west</h2>
<div class="outline-text-2" id="text-8">
<p>
Done
</p>
</div>
</div>
<div id="outline-container-org61172ce" class="outline-2">
<h2 id="org61172ce"><span class="section-number-2">9.</span> steel-pan lilypond</h2>
<div class="outline-text-2" id="text-9">
<p>
Recent lilypond broke steel-pan notation. Fixed shake-and-stomp as
a prototype solution. May need to find an approach that is less brittle.
</p>
</div>
</div>
<div id="outline-container-org49fc2eb" class="outline-2">
<h2 id="org49fc2eb"><span class="section-number-2">10.</span> tbattery</h2>
<div class="outline-text-2" id="text-10">
<p>
(Old news). Wrote battery status monitor for FVWM integration based on
tclock in February.
</p>
</div>
</div>
<div id="outline-container-org501484f" class="outline-2">
<h2 id="org501484f"><span class="section-number-2">11.</span> ca-r</h2>
<div class="outline-text-2" id="text-11">
<p>
Data no longer being updated, so weekly builds are stopped.
</p>
</div>
</div>
<div id="outline-container-org593da51" class="outline-2">
<h2 id="org593da51"><span class="section-number-2">12.</span> xz compromise</h2>
<div class="outline-text-2" id="text-12">
<p>
Kaveri updated.
</p>
</div>
</div>
<div id="outline-container-org6d0c6d0" class="outline-2">
<h2 id="org6d0c6d0"><span class="section-number-2">13.</span> CA Root Key Generation</h2>
<div class="outline-text-2" id="text-13">
<p>
Nice to have an appliance that manages keys.  Need to make this
simple. Really don't have time for a science project.  Too, bad,
though. It kind of <b>is</b> a science project.  Could just buy something
from nitrokey <a href="https://www.nitrokey.com/">https://www.nitrokey.com/</a> but I really don't want to
spend money on it of I have hardware already.  Looking at nitrokey in
more detail, it doesn't seem to be any simpler than what I'm doing
already.
</p>
</div>
<div id="outline-container-org4668b48" class="outline-3">
<h3 id="org4668b48"><span class="section-number-3">13.1.</span> First pass done</h3>
<div class="outline-text-3" id="text-13-1">
</div>
<div id="outline-container-org4349344" class="outline-4">
<h4 id="org4349344"><span class="section-number-4">13.1.1.</span> Based on <a href="https://pki-tutorial.readthedocs.io/en/latest/simple/">https://pki-tutorial.readthedocs.io/en/latest/simple/</a></h4>
<div class="outline-text-4" id="text-13-1-1">
<p>
Interesting that the certs generated fail with openssl s<sub>server</sub> testing because
the cryptographic algorithms are too weak.
</p>
</div>
</div>
<div id="outline-container-org4a1577c" class="outline-4">
<h4 id="org4a1577c"><span class="section-number-4">13.1.2.</span> Work continues</h4>
<div class="outline-text-4" id="text-13-1-2">
</div>
<ol class="org-ol">
<li><a id="orgda7424f"></a>Have an outline with ECDSA/NIST-384<br /></li>
<li><a id="org1ae559e"></a>Have consolidated configuration across CAs.<br /></li>
<li><a id="org138599f"></a>Trying to decide if/how to deal with revocation. What a PITA.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgc7e1004" class="outline-3">
<h3 id="orgc7e1004"><span class="section-number-3">13.2.</span> Need to be clear on security properties.</h3>
<div class="outline-text-3" id="text-13-2">
<p>
Definitely protect against remote access to private keys. How strong
does the protection against <b>local</b> access need to be?
</p>
</div>
</div>
<div id="outline-container-orge6e22cf" class="outline-3">
<h3 id="orge6e22cf"><span class="section-number-3">13.3.</span> Simple hardware.</h3>
<div class="outline-text-3" id="text-13-3">
</div>
<div id="outline-container-org8cca178" class="outline-4">
<h4 id="org8cca178"><span class="section-number-4">13.3.1.</span> Use beagleboard with local interface</h4>
</div>
<div id="outline-container-orga71378a" class="outline-4">
<h4 id="orga71378a"><span class="section-number-4">13.3.2.</span> Use some modern device TPM</h4>
<div class="outline-text-4" id="text-13-3-2">
<p>
Need to export data for backup.
</p>
</div>
</div>
<div id="outline-container-orgd0d49ee" class="outline-4">
<h4 id="orgd0d49ee"><span class="section-number-4">13.3.3.</span> Or something that uses PKCS11 interface</h4>
</div>
</div>
<div id="outline-container-orge987efd" class="outline-3">
<h3 id="orge987efd"><span class="section-number-3">13.4.</span> USB Serial interface only but no credentials across USB I/F.</h3>
<div class="outline-text-3" id="text-13-4">
<p>
But this potentially exposes the hardware to remote access via the USB
I/F when connected.
</p>
</div>
</div>
<div id="outline-container-org845ee34" class="outline-3">
<h3 id="org845ee34"><span class="section-number-3">13.5.</span> Use Sneakernet</h3>
<div class="outline-text-3" id="text-13-5">
<p>
Doesn't scale. Should use something so cert updates are automatable.
But that's a science project it seems.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfad7eea" class="outline-2">
<h2 id="orgfad7eea"><span class="section-number-2">14.</span> Compilers</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org24cc600" class="outline-3">
<h3 id="org24cc600"><span class="section-number-3">14.1.</span> Compiled Wikipedia PL/0 example</h3>
</div>
<div id="outline-container-orgb44a01b" class="outline-3">
<h3 id="orgb44a01b"><span class="section-number-3">14.2.</span> Work out overall plan.</h3>
<div class="outline-text-3" id="text-14-2">
<p>
Lots of moving pieces.
</p>
</div>
</div>
<div id="outline-container-orgb83c859" class="outline-3">
<h3 id="orgb83c859"><span class="section-number-3">14.3.</span> Looking into LLVM MLIR.</h3>
<div class="outline-text-3" id="text-14-3">
<p>
Will not use immediately, but perhaps trend in that direction.
</p>
</div>
</div>
<div id="outline-container-orgf3049e8" class="outline-3">
<h3 id="orgf3049e8"><span class="section-number-3">14.4.</span> ASDL</h3>
<div class="outline-text-3" id="text-14-4">
</div>
<div id="outline-container-org2e7b56c" class="outline-4">
<h4 id="org2e7b56c"><span class="section-number-4">14.4.1.</span> current smlnj C++ implementation incomplete</h4>
</div>
<div id="outline-container-orgb2ac089" class="outline-4">
<h4 id="orgb2ac089"><span class="section-number-4">14.4.2.</span> old versions asdl source fail to build with new versions of smlnj</h4>
</div>
<div id="outline-container-orged19f3a" class="outline-4">
<h4 id="orged19f3a"><span class="section-number-4">14.4.3.</span> old versions of smlnj not easily buildable on x86<sub>64</sub></h4>
</div>
<div id="outline-container-org106872a" class="outline-4">
<h4 id="org106872a"><span class="section-number-4">14.4.4.</span> ancient binary of asdl 1.2 compiler seems to work</h4>
<div class="outline-text-4" id="text-14-4-4">
<p>
but associated libraries are to old to link because of missing ctype symbol
</p>
</div>
</div>
<div id="outline-container-orgf742429" class="outline-4">
<h4 id="orgf742429"><span class="section-number-4">14.4.5.</span> analyzing asdl 1.2 generated code</h4>
<div class="outline-text-4" id="text-14-4-5">
<p>
Most of the code is for serialization, which is going to be replaced
anyway, so can be removed by hand.
</p>
</div>
</div>
<div id="outline-container-org23d4996" class="outline-4">
<h4 id="org23d4996"><span class="section-number-4">14.4.6.</span> run in vm?</h4>
<div class="outline-text-4" id="text-14-4-6">
<p>
Analysis of binaries shows that it was built on some redhat os using
gcc 2.8.1. Redhat-6.2? No. Tried various ancient Redhat OSs.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgae3e16b" class="outline-2">
<h2 id="orgae3e16b"><span class="section-number-2">15.</span> Piper dovecot</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org717527d" class="outline-3">
<h3 id="org717527d"><span class="section-number-3">15.1.</span> Update broke dovecot auth.</h3>
<div class="outline-text-3" id="text-15-1">
<p>
Looks PAM related, but PAM update failed to fix.
</p>
</div>
</div>
<div id="outline-container-orgf0c7539" class="outline-3">
<h3 id="orgf0c7539"><span class="section-number-3">15.2.</span> Set tuffy up as a staging server</h3>
<div class="outline-text-3" id="text-15-2">
<p>
So I don't debug on 'production'.
</p>
</div>
</div>
<div id="outline-container-org2604723" class="outline-3">
<h3 id="org2604723"><span class="section-number-3">15.3.</span> piper dovecot SSL certificate <b>NOT</b> broken</h3>
<div class="outline-text-3" id="text-15-3">
<p>
At least not obviously broken (yet). Further investigation needed.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb054e7b" class="outline-2">
<h2 id="orgb054e7b"><span class="section-number-2">16.</span> Various i686</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orge9e3b5d" class="outline-4">
<h4 id="orge9e3b5d"><span class="section-number-4">16.0.1.</span> netbsd</h4>
<div class="outline-text-4" id="text-16-0-1">
<p>
was installed. But needed the box for something else.
</p>
</div>
</div>
<div id="outline-container-orgc33ff76" class="outline-4">
<h4 id="orgc33ff76"><span class="section-number-4">16.0.2.</span> buildroot</h4>
<div class="outline-text-4" id="text-16-0-2">
<p>
builds complete.
</p>
</div>
</div>
</div>
<div id="outline-container-org8dfdbb6" class="outline-2">
<h2 id="org8dfdbb6"><span class="section-number-2">17.</span> piper</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orge5a3a45" class="outline-3">
<h3 id="orge5a3a45"><span class="section-number-3">17.1.</span> dovecot</h3>
<div class="outline-text-3" id="text-17-1">
</div>
<div id="outline-container-org64b6dc6" class="outline-4">
<h4 id="org64b6dc6"><span class="section-number-4">17.1.1.</span> Raising apparmor error.</h4>
<div class="outline-text-4" id="text-17-1-1">
<p>
Not sure how to resolve.
</p>
</div>
</div>
</div>
<div id="outline-container-orga798e8f" class="outline-3">
<h3 id="orga798e8f"><span class="section-number-3">17.2.</span> pidgeonhole</h3>
<div class="outline-text-3" id="text-17-2">
</div>
<div id="outline-container-org7727fe7" class="outline-4">
<h4 id="org7727fe7"><span class="section-number-4">17.2.1.</span> procmail replacement.</h4>
</div>
<div id="outline-container-org1921af7" class="outline-4">
<h4 id="org1921af7"><span class="section-number-4">17.2.2.</span> Considering integration.</h4>
</div>
</div>
<div id="outline-container-orgf877e27" class="outline-3">
<h3 id="orgf877e27"><span class="section-number-3">17.3.</span> httpd</h3>
<div class="outline-text-3" id="text-17-3">
</div>
<div id="outline-container-orgec154fb" class="outline-4">
<h4 id="orgec154fb"><span class="section-number-4">17.3.1.</span> Still stable.</h4>
<div class="outline-text-4" id="text-17-3-1">
<p>
But seems to occassionally mis-serve files.
</p>
</div>
</div>
</div>
<div id="outline-container-org4115220" class="outline-3">
<h3 id="org4115220"><span class="section-number-3">17.4.</span> SSL cert</h3>
<div class="outline-text-3" id="text-17-4">
<p>
Trying letsencrypt with certbot. http problem above may be interfering.
</p>
</div>
</div>
<div id="outline-container-org9fe3b10" class="outline-3">
<h3 id="org9fe3b10"><span class="section-number-3">17.5.</span> redmine</h3>
<div class="outline-text-3" id="text-17-5">
<p>
Still not sure I want to go down this rabbit hole.
</p>
</div>
</div>
<div id="outline-container-orgee39d13" class="outline-3">
<h3 id="orgee39d13"><span class="section-number-3">17.6.</span> openvpn</h3>
<div class="outline-text-3" id="text-17-6">
<p>
Need to consider cert construction.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf30fc07" class="outline-2">
<h2 id="orgf30fc07"><span class="section-number-2">18.</span> Buffalo WZR-HP-G300NH</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org18d0953" class="outline-3">
<h3 id="org18d0953"><span class="section-number-3">18.1.</span> Update</h3>
<div class="outline-text-3" id="text-18-1">
<p>
Sometime next year.
</p>
</div>
</div>
</div>
