status/2024/0517.html
<div id="outline-container-org3fbebaf" class="outline-2">
<h2 id="org3fbebaf"><span class="section-number-2">19.</span> SJC weather station</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-orgb3af366" class="outline-3">
<h3 id="orgb3af366"><span class="section-number-3">19.1.</span> Proper enclosure mostly constructed</h3>
<div class="outline-text-3" id="text-19-1">
</div>
<div id="outline-container-orgc56fca0" class="outline-4">
<h4 id="orgc56fca0"><span class="section-number-4">19.1.1.</span> Needs a redo on bottom plate</h4>
</div>
<div id="outline-container-orgba51fb3" class="outline-4">
<h4 id="orgba51fb3"><span class="section-number-4">19.1.2.</span> Seems to have improved wireless connectivity somewhat</h4>
</div>
</div>
</div>
<div id="outline-container-orge67b96f" class="outline-2">
<h2 id="orge67b96f"><span class="section-number-2">20.</span> opencl</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-orga2cb3a9" class="outline-3">
<h3 id="orga2cb3a9"><span class="section-number-3">20.1.</span> Studying. Have some examples working.</h3>
</div>
<div id="outline-container-orgf3417ff" class="outline-3">
<h3 id="orgf3417ff"><span class="section-number-3">20.2.</span> Need to look at arrayfire as an alternative.</h3>
</div>
<div id="outline-container-orgc74734b" class="outline-3">
<h3 id="orgc74734b"><span class="section-number-3">20.3.</span> This is a bit of a hammer looking for a nail.</h3>
</div>
</div>
<div id="outline-container-org2bec67d" class="outline-2">
<h2 id="org2bec67d"><span class="section-number-2">21.</span> EPLDH</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-org9964038" class="outline-3">
<h3 id="org9964038"><span class="section-number-3">21.1.</span> MPFI interval arithmetic better alternative</h3>
</div>
</div>
<div id="outline-container-org024aef3" class="outline-2">
<h2 id="org024aef3"><span class="section-number-2">22.</span> wktpqb</h2>
<div class="outline-text-2" id="text-22">
</div>
<div id="outline-container-org945b916" class="outline-3">
<h3 id="org945b916"><span class="section-number-3">22.1.</span> needs a new approach</h3>
</div>
<div id="outline-container-orgcd4f205" class="outline-3">
<h3 id="orgcd4f205"><span class="section-number-3">22.2.</span> Verifying edge construction (con't.)</h3>
</div>
<div id="outline-container-orgfa607f2" class="outline-3">
<h3 id="orgfa607f2"><span class="section-number-3">22.3.</span> 'gcd' algorithm doesn't work</h3>
</div>
</div>
<div id="outline-container-org93070ed" class="outline-2">
<h2 id="org93070ed"><span class="section-number-2">23.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-23">
</div>
<div id="outline-container-org576dc52" class="outline-3">
<h3 id="org576dc52"><span class="section-number-3">23.1.</span> Mounted on mill - ready or testing</h3>
</div>
<div id="outline-container-org4113518" class="outline-3">
<h3 id="org4113518"><span class="section-number-3">23.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-23-2">
</div>
<div id="outline-container-org32e45e8" class="outline-4">
<h4 id="org32e45e8"><span class="section-number-4">23.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-orgad0395c" class="outline-4">
<h4 id="orgad0395c"><span class="section-number-4">23.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-23-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
<div id="outline-container-org5d64c44" class="outline-3">
<h3 id="org5d64c44"><span class="section-number-3">23.3.</span> Alternative architecture</h3>
<div class="outline-text-3" id="text-23-3">
</div>
<div id="outline-container-org5976a09" class="outline-4">
<h4 id="org5976a09"><span class="section-number-4">23.3.1.</span> Split off stepper motor controller to separate board</h4>
<div class="outline-text-4" id="text-23-3-1">
<p>
Increase latency tolerance on controller
</p>
</div>
</div>
<div id="outline-container-org3bef7f6" class="outline-4">
<h4 id="org3bef7f6"><span class="section-number-4">23.3.2.</span> Use emc2 MODBUS/TCP protocol for stepper and other IO</h4>
</div>
</div>
</div>
<div id="outline-container-org25eddcf" class="outline-2">
<h2 id="org25eddcf"><span class="section-number-2">24.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-24">
</div>
<div id="outline-container-orged30686" class="outline-3">
<h3 id="orged30686"><span class="section-number-3">24.1.</span> May have problem with network power module.</h3>
<div class="outline-text-3" id="text-24-1">
<p>
It's only 30 years old or something like that.
</p>
</div>
</div>
<div id="outline-container-org5d31d65" class="outline-3">
<h3 id="org5d31d65"><span class="section-number-3">24.2.</span> Added Ethernet card to tuffy</h3>
<div class="outline-text-3" id="text-24-2">
<p>
Preparing  as backup/staging server.
</p>
</div>
</div>
<div id="outline-container-orgb387196" class="outline-3">
<h3 id="orgb387196"><span class="section-number-3">24.3.</span> Need a VPS with static IP</h3>
<div class="outline-text-3" id="text-24-3">
<p>
Just use dynamic interface to bind.
</p>
</div>
</div>
</div>
<div id="outline-container-org5941bc4" class="outline-2">
<h2 id="org5941bc4"><span class="section-number-2">25.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-25">
</div>
<div id="outline-container-orgf7e32aa" class="outline-3">
<h3 id="orgf7e32aa"><span class="section-number-3">25.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-25-1">
</div>
<div id="outline-container-org2adefa5" class="outline-4">
<h4 id="org2adefa5"><span class="section-number-4">25.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-org02ac308" class="outline-3">
<h3 id="org02ac308"><span class="section-number-3">25.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
<div id="outline-container-org1c7d4ef" class="outline-3">
<h3 id="org1c7d4ef"><span class="section-number-3">25.3.</span> maybe should treat as platform for concatinative synthesis</h3>
</div>
<div id="outline-container-orgf44a342" class="outline-3">
<h3 id="orgf44a342"><span class="section-number-3">25.4.</span> maybe should just accept the limitations and work with it</h3>
<div class="outline-text-3" id="text-25-4">
<p>
One should not be disappointed that a guitar can't sound like a flute.
</p>
</div>
</div>
</div>
<div id="outline-container-org9322288" class="outline-2">
<h2 id="org9322288"><span class="section-number-2">26.</span> gat</h2>
<div class="outline-text-2" id="text-26">
</div>
<div id="outline-container-org652ea7d" class="outline-3">
<h3 id="org652ea7d"><span class="section-number-3">26.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-org87cbb11" class="outline-2">
<h2 id="org87cbb11"><span class="section-number-2">27.</span> RIOT drivers</h2>
<div class="outline-text-2" id="text-27">
<p>
Implemented - needs testing.
</p>
</div>
<div id="outline-container-orgaa4234d" class="outline-3">
<h3 id="orgaa4234d"><span class="section-number-3">27.1.</span> WS2801</h3>
</div>
<div id="outline-container-orgf50fa64" class="outline-3">
<h3 id="orgf50fa64"><span class="section-number-3">27.2.</span> Velleman KA03</h3>
</div>
<div id="outline-container-org9fb055d" class="outline-3">
<h3 id="org9fb055d"><span class="section-number-3">27.3.</span> Velleman KA05</h3>
</div>
</div>
<div id="outline-container-org530cea8" class="outline-2">
<h2 id="org530cea8"><span class="section-number-2">28.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-28">
</div>
<div id="outline-container-orgb3b610b" class="outline-3">
<h3 id="orgb3b610b"><span class="section-number-3">28.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-orga2f42d1" class="outline-3">
<h3 id="orga2f42d1"><span class="section-number-3">28.2.</span> Planning software.</h3>
</div>
<div id="outline-container-orgfe5e255" class="outline-3">
<h3 id="orgfe5e255"><span class="section-number-3">28.3.</span> Received STM32F767 Nucleo144 with Ethernet.</h3>
<div class="outline-text-3" id="text-28-3">
</div>
<div id="outline-container-org0d81c46" class="outline-4">
<h4 id="org0d81c46"><span class="section-number-4">28.3.1.</span> Test program running.</h4>
</div>
<div id="outline-container-orge233df0" class="outline-4">
<h4 id="orge233df0"><span class="section-number-4">28.3.2.</span> Need to consider CoAP multicast discovery.</h4>
</div>
<div id="outline-container-orgf9a05c6" class="outline-4">
<h4 id="orgf9a05c6"><span class="section-number-4">28.3.3.</span> Consider simpler architecture with STM32F767 as a 'hub'.</h4>
</div>
<div id="outline-container-org689a044" class="outline-4">
<h4 id="org689a044"><span class="section-number-4">28.3.4.</span> Consider CAN interface to hub.</h4>
</div>
</div>
</div>
<div id="outline-container-orge7f0178" class="outline-2">
<h2 id="orge7f0178"><span class="section-number-2">29.</span> AMD 2900 bitslice computing</h2>
<div class="outline-text-2" id="text-29">
</div>
<div id="outline-container-org6290df1" class="outline-3">
<h3 id="org6290df1"><span class="section-number-3">29.1.</span> Probably my oldest uncompleted project</h3>
</div>
<div id="outline-container-org92d286c" class="outline-3">
<h3 id="org92d286c"><span class="section-number-3">29.2.</span> Exploring possibilities for something constructive</h3>
<div class="outline-text-3" id="text-29-2">
<p>
Create verilog models for 2903/2910 and verify against hardware?
</p>
</div>
</div>
</div>
<div id="outline-container-org13c22ce" class="outline-2">
<h2 id="org13c22ce"><span class="section-number-2">30.</span> Hitachi HD68B09E CPU</h2>
<div class="outline-text-2" id="text-30">
</div>
<div id="outline-container-orgf40ed03" class="outline-3">
<h3 id="orgf40ed03"><span class="section-number-3">30.1.</span> RAM/UART/IO</h3>
</div>
<div id="outline-container-orgadd0896" class="outline-3">
<h3 id="orgadd0896"><span class="section-number-3">30.2.</span> Started schematic</h3>
<div class="outline-text-3" id="text-30-2">
</div>
<div id="outline-container-orge07400b" class="outline-4">
<h4 id="orge07400b"><span class="section-number-4">30.2.1.</span> Standard peripheral set for 8 bit CPU bringups</h4>
<div class="outline-text-4" id="text-30-2-1">
<p>
Board schematic planned - need Kicad symbols
</p>
</div>
</div>
</div>
<div id="outline-container-org6f373ec" class="outline-3">
<h3 id="org6f373ec"><span class="section-number-3">30.3.</span> Arduino Mega 2560 DMA loader</h3>
<div class="outline-text-3" id="text-30-3">
<p>
&#x2026;Along with standard 8 bit loader
</p>
</div>
</div>
<div id="outline-container-org328441b" class="outline-3">
<h3 id="org328441b"><span class="section-number-3">30.4.</span> Generate quadrature clock directly</h3>
</div>
<div id="outline-container-orga0f6154" class="outline-3">
<h3 id="orga0f6154"><span class="section-number-3">30.5.</span> Full Bus SW Emulation infeasible</h3>
<div class="outline-text-3" id="text-30-5">
<p>
6809 1000ns maximum cycle time too short
</p>
</div>
</div>
</div>
<div id="outline-container-org2f4ca48" class="outline-2">
<h2 id="org2f4ca48"><span class="section-number-2">31.</span> Rockwell R65F11</h2>
<div class="outline-text-2" id="text-31">
</div>
<div id="outline-container-orgb6d1cd5" class="outline-3">
<h3 id="orgb6d1cd5"><span class="section-number-3">31.1.</span> Still evaluating.</h3>
</div>
<div id="outline-container-org90ded1f" class="outline-3">
<h3 id="org90ded1f"><span class="section-number-3">31.2.</span> Dev board</h3>
<div class="outline-text-3" id="text-31-2">
<p>
Reverse engineered some of a mostly fully built development board with
one part missing. As near as I can tell, that one part is some sort of
programmable address decoder with a pinout that does not correspond to
any part I can find. Kind of like a GAL but with inputs on top and
outputs on bottom (as opposed to left and right in a standard GAL). I
have no idea what the provenance of this board is and if it ever
worked.
</p>
</div>
</div>
</div>
