status/src/2024/0517.org
* PLD programming
Looks like Atmel 16V8 is the last 5V PLD part left standing. Maybe not
surprising that there still doesn't appear to be a fully open source
tool chain for programming. How hard could it be? (!) Could next-pnr
generic help? Might be easier to use espresso for logic array and program
output logic bits directly for simple stuff.
* EPROM Programming
Found some software for Needham programmer. Need to check electrolytic
caps on ISA board.
* POSIT
** Use POSITs for YRX?
No. Existing library is fine.
* MAME
** Subset builds in debug mode
Full debug fails - not enough disk or memory.
** gs6809 serial IO doesn't work right with PTY and other streams
** ampro (Z80/Z80SIO) *does* work with PTY
** Evaluating what is needed for other emulators.
* More project ideas
** Zuse Z3 simulation in Verilog
   Good excuse for floating point ALU design. Try posit format?
** GMPForth ports to simulators
*** SIMH for some targets (vax)
*** MAME looks interesting for microprocessor system emulations
    How to support ersatz systems?
*** Ports to classic figFORTH targets
** GMPASM assembler
   May be useful for handbuilt and rare systems (DMX1000?).
** Extracting ISO Superboard Forth ROMS for MAME emulation
** 'bwocl' OpenCL tooling
*** Offline compilation
*** Standard Kernel Running
** hardware support for classic 5V CPUs
*** RTX2000, CDP1802 still available!
*** 6502, 68000, 320C30, others on hand
*** CPUs with totally async bus may be supportable without RAM
*** Could use small footprint monitor in asm (gmpmon?)
** Existing 'retro' hardware still working?
*** OSI Superboard
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
*** Super Jolt
No output. Needs analysis.
*** Ampro Little Board
Not booting. Needs analysis.
*** Rockwell R65F11 Demo board
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
MAME emulator possibilities?
*** NMIX-0016
Works. Found original prom in a parts stash(!).
* David Davies
** Broadcom (BCG?) Employee indicted for running a brothel.
** New case C1923172, consolidated with *15* Parties.
** Court website no longer allows seaching (grrr!)
