status/2024/0517.html
<div id="outline-container-orga1bff4f" class="outline-2">
<h2 id="orga1bff4f"><span class="section-number-2">32.</span> PLD programming</h2>
<div class="outline-text-2" id="text-32">
<p>
Looks like Atmel 16V8 is the last 5V PLD part left standing. Maybe not
surprising that there still doesn't appear to be a fully open source
tool chain for programming. How hard could it be? (!) Could next-pnr
generic help? Might be easier to use espresso for logic array and program
output logic bits directly for simple stuff.
</p>
</div>
</div>
<div id="outline-container-org235a1d8" class="outline-2">
<h2 id="org235a1d8"><span class="section-number-2">33.</span> EPROM Programming</h2>
<div class="outline-text-2" id="text-33">
<p>
Found some software for Needham programmer. Need to check electrolytic
caps on ISA board.
</p>
</div>
</div>
<div id="outline-container-orgf7df842" class="outline-2">
<h2 id="orgf7df842"><span class="section-number-2">34.</span> POSIT</h2>
<div class="outline-text-2" id="text-34">
</div>
<div id="outline-container-orgd71b8e2" class="outline-3">
<h3 id="orgd71b8e2"><span class="section-number-3">34.1.</span> Use POSITs for YRX?</h3>
<div class="outline-text-3" id="text-34-1">
<p>
No. Existing library is fine.
</p>
</div>
</div>
</div>
<div id="outline-container-org2acef40" class="outline-2">
<h2 id="org2acef40"><span class="section-number-2">35.</span> MAME</h2>
<div class="outline-text-2" id="text-35">
</div>
<div id="outline-container-org8355266" class="outline-3">
<h3 id="org8355266"><span class="section-number-3">35.1.</span> Subset builds in debug mode</h3>
<div class="outline-text-3" id="text-35-1">
<p>
Full debug fails - not enough disk or memory.
</p>
</div>
</div>
<div id="outline-container-org49abe11" class="outline-3">
<h3 id="org49abe11"><span class="section-number-3">35.2.</span> gs6809 serial IO doesn't work right with PTY and other streams</h3>
</div>
<div id="outline-container-org5bbcdc9" class="outline-3">
<h3 id="org5bbcdc9"><span class="section-number-3">35.3.</span> ampro (Z80/Z80SIO) <b>does</b> work with PTY</h3>
</div>
<div id="outline-container-org78f9687" class="outline-3">
<h3 id="org78f9687"><span class="section-number-3">35.4.</span> Evaluating what is needed for other emulators.</h3>
</div>
</div>
<div id="outline-container-org1fdf409" class="outline-2">
<h2 id="org1fdf409"><span class="section-number-2">36.</span> More project ideas</h2>
<div class="outline-text-2" id="text-36">
</div>
<div id="outline-container-org6f4d133" class="outline-3">
<h3 id="org6f4d133"><span class="section-number-3">36.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-36-1">
<p>
Good excuse for floating point ALU design. Try posit format?
</p>
</div>
</div>
<div id="outline-container-org1ebf782" class="outline-3">
<h3 id="org1ebf782"><span class="section-number-3">36.2.</span> GMPForth ports to simulators</h3>
<div class="outline-text-3" id="text-36-2">
</div>
<div id="outline-container-orgc6b0e5e" class="outline-4">
<h4 id="orgc6b0e5e"><span class="section-number-4">36.2.1.</span> SIMH for some targets (vax)</h4>
</div>
<div id="outline-container-orga7b318e" class="outline-4">
<h4 id="orga7b318e"><span class="section-number-4">36.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-36-2-2">
<p>
How to support ersatz systems?
</p>
</div>
</div>
<div id="outline-container-orgbb22651" class="outline-4">
<h4 id="orgbb22651"><span class="section-number-4">36.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org1bbfc52" class="outline-3">
<h3 id="org1bbfc52"><span class="section-number-3">36.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-36-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-orgf165860" class="outline-3">
<h3 id="orgf165860"><span class="section-number-3">36.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org3a42a80" class="outline-3">
<h3 id="org3a42a80"><span class="section-number-3">36.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-36-5">
</div>
<div id="outline-container-orgbe3c225" class="outline-4">
<h4 id="orgbe3c225"><span class="section-number-4">36.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-orge88f10f" class="outline-4">
<h4 id="orge88f10f"><span class="section-number-4">36.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-orgede07b9" class="outline-3">
<h3 id="orgede07b9"><span class="section-number-3">36.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-36-6">
</div>
<div id="outline-container-orga991edd" class="outline-4">
<h4 id="orga991edd"><span class="section-number-4">36.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-orge0be7b7" class="outline-4">
<h4 id="orge0be7b7"><span class="section-number-4">36.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-orgb06204c" class="outline-4">
<h4 id="orgb06204c"><span class="section-number-4">36.6.3.</span> CPUs with totally async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-org5fb72f4" class="outline-4">
<h4 id="org5fb72f4"><span class="section-number-4">36.6.4.</span> Could use small footprint monitor in asm (gmpmon?)</h4>
</div>
</div>
<div id="outline-container-orge08f3db" class="outline-3">
<h3 id="orge08f3db"><span class="section-number-3">36.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-36-7">
</div>
<div id="outline-container-org8461911" class="outline-4">
<h4 id="org8461911"><span class="section-number-4">36.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-36-7-1">
<p>
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
</p>
</div>
</div>
<div id="outline-container-org2cb587d" class="outline-4">
<h4 id="org2cb587d"><span class="section-number-4">36.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-36-7-2">
<p>
No output. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org43a0106" class="outline-4">
<h4 id="org43a0106"><span class="section-number-4">36.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-36-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org72c275c" class="outline-4">
<h4 id="org72c275c"><span class="section-number-4">36.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-36-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
MAME emulator possibilities?
</p>
</div>
</div>
<div id="outline-container-orgcb014b5" class="outline-4">
<h4 id="orgcb014b5"><span class="section-number-4">36.7.5.</span> NMIX-0016</h4>
<div class="outline-text-4" id="text-36-7-5">
<p>
Works. Found original prom in a parts stash(!).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcdffc4b" class="outline-2">
<h2 id="orgcdffc4b"><span class="section-number-2">37.</span> David Davies</h2>
<div class="outline-text-2" id="text-37">
</div>
<div id="outline-container-orgf0bc600" class="outline-3">
<h3 id="orgf0bc600"><span class="section-number-3">37.1.</span> Broadcom (BCG?) Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orga29c4bc" class="outline-3">
<h3 id="orga29c4bc"><span class="section-number-3">37.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org057005c" class="outline-3">
<h3 id="org057005c"><span class="section-number-3">37.3.</span> Court website no longer allows seaching (grrr!)</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2024-05-25 Sat 06:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
